of90/tutorials/rheoMultiRegionFoam/calibrator/0/polymer/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    
    p_inlet
    {
        type            zeroGradient;
    }
    
    p_outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    p_down
    {
        type            zeroGradient;
    }
    
    inter.polymer
    {
        type            zeroGradient;
    }
     
    "(bottom|top)"  
    {
        type             empty;
    }
}

// ************************************************************************* //
