of90/tutorials/rheoMultiRegionFoam/calibrator/system/calibrator/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(T.*)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0;
    }

}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
