of90/tutorials/rheoMultiRegionFoam/calibrator/system/polymer/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
solvers
{
    "(T.*)"
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-10;
        relTol           0.;
        minIter          0;
        maxIter          800;
        
    }
    
    "(U)"
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-10;
        relTol           0.;
        minIter          0;
        maxIter          800;
        
    }
    
    "(p_rgh)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-10;
        relTol           0.;
        minIter          0;
        maxIter          800;
        
    }
}

PIMPLE
{
  frozenFlow true; 
  
  nInIter  1;
  nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    
}

// ************************************************************************* //
